#pragma once

// ---------------------------------------------------------
// C++ Includes
// ---------------------------------------------------------
#include <chrono>

// =========================================================
// FPS固定制御クラス
// =========================================================
class FPSController {
public:
	// =========================================================
	// Public Methods
	// =========================================================

	/// <summary>
	/// インスタンスを取得します。
	/// </summary>
	/// <returns>シングルトンインスタンス</returns>
	static FPSController* GetInstance();

	/// <summary>
	/// 初期化処理を行います。
	/// </summary>
	void InitializeFixFPS();

	/// <summary>
	/// FPS固定更新処理を行います。
	/// </summary>
	void UpdateFixFPS();

private:
	// =========================================================
	// Member Variables
	// =========================================================

	std::chrono::steady_clock::time_point reference_;		/* 基準時間 */
};
