#pragma once

// ---------------------------------------------------------
// Engine Includes
// ---------------------------------------------------------
#include <MyMath.h>

// =========================================================
// スケール・回転（オイラー角）・平行移動をまとめた変換
// =========================================================
class Transform {
public:
	Float3 scale;
	Float3 rotate;
	Float3 translate;

	// =========================================================
	// Public Methods
	// =========================================================

	/// <summary>
	/// アフィン変換行列を生成します。
	/// </summary>
	/// <returns>生成されたアフィン変換行列</returns>
	Matrix MakeAffineMatrix();
};
